/****************************************************************************
Задача 3_2.

Дан массив целых чисел А[0..n-1]. Известно, что на интервале
[0, m] значения массива строго возрастают, а на интервале [m, n-1]
строго убывают. Найти m за O(log m).
2 ≤ n ≤ 10000.

  in                   | out
  ---------------------|-----
  10                   | 6
  1 2 3 4 5 6 7 6 5 4  | 

****************************************************************************/

#include <iostream>
#include <vector>

int main() {
	int n; std::cin >> n;
	std::vector<int> a(n);
	for (auto& x : a) std::cin >> x;

	if (n == 1) std::cout << 0, exit(0);

	int l = 0, r = n;

	while (l < r) {
		int p = (l + r) / 2;
		if ((p == n-1 || a[p] > a[p+1]) && (p == 0 || a[p] > a[p-1])) std::cout << p, exit(0);
		if (a[p-1] < a[p+1]) l = p;
		else r = p;
	}
}
